#ifndef __HH_VISMGAZETRACKING_HH__
#define __HH_VISMGAZETRACKING_HH__
#include "opencv2/opencv.hpp"
#include "EyeTracking_Def.h"
#include <vector>
#include <iostream>
#include <string>
#include <queue>
#include "../shared_modules/pupil_detectors/detect_2d.hpp"
#include "../shared_modules/pupil_detectors/singleeyefitter/EyeModelFitter.h"
#include "../shared_modules/pupil_detectors/Blink_Detection.hpp"
#include "../shared_modules/calibration/bundleCalibration.h"


/* ʹ�ò��裺
1��Ŀǰû�в������ʲ��ö�ȡ��
while
2����ͼ��
3��CalcGazePointPosition3D ֱ�����ش���0��ֵ��˵������3Dģ�ͽ����ɹ���
end
4��onlineCalibration3D �ɼ�9��궨���ݣ�ע���ʱһ�����ܲ������λ��
5��GetMappingResult9_3D �궨
6��CalcGazePointPosition3D ��ȡ�ӵ�


*/
class CGazeTrakingM
{
public:
	CGazeTrakingM();
	~CGazeTrakingM();

	//*******************************************************
	//��    �ܣ� ����ȡ������Ϣ��
	//��������� 
	//    [in]    filename       �洢�ļ�����xml�ļ�����
	//�� �� ֵ��
	//     true ������ȡ�ɹ�
	//�޸���־��
	//*******************************************************
	bool ReadParams(std::string filename);

	//*******************************************************
	//��    �ܣ� ���ɼ�ͼ����Ϣ��
	//��������� 
	//    [in]    imageL         ���۾�˫Ŀ�������
	//    [in]    imageR         ���۾�˫Ŀ�������
	//�� �� ֵ��
	//     true ������ȡ�ɹ�
	//�޸���־��
	//*******************************************************
	bool ReadImage(cv::Mat imageL, cv::Mat imageR);
	

    //*******************************************************
	//��    �ܣ� ���ɼ�ͼ����Ϣ��
	//��������� 
	//    [in]    image         ���������������Ϣ
	//�� �� ֵ��
	//     true ������ȡ�ɹ�
	//�޸���־��
	//*******************************************************
	bool ReadImage(uchar* image);
	//*******************************************************
	//��    �ܣ� ���궨����͹���ļнǡ�
	//��������� 
	//    [in]    pt2d         ��Ļע�ӵ����꣨2D�������ص�λ
	//�� �� ֵ��
	//     true �����궨�ɹ�
	//�޸���־��
	//*******************************************************
	bool onlineCalibration(cv::Point2f gazePoint);
	
	//*******************************************************
	//��    �ܣ� �����߱궨������Ҫ��ǰ������readImage  ---- �궨�������á�
	//��������� 
	//    [in]    image            ���������ͼ������
	//    [in]    disThreshold     ͫ��������ͼ���в��ľ���pixel
	//    [in]    gazePoint        ��Ļ�ϵ�ע�ӵ�piexel
	//�� �� ֵ��
	//     true �����궨�ɹ�
	//�޸���־��
	//*******************************************************
	bool onlineCalibration(uchar* image, double disTheshold, cv::Point2f gazePoint);

	//*******************************************************
	//��    �ܣ� �����߱궨---Mapping��
	//��������� 
	//    [in]    image            ���������ͼ������
	//    [in]    disThreshold     ͫ��������ͼ���в��ľ���pixel
	//    [in]    gazePoint        ��Ļ�ϵ�ע�ӵ�piexel
	//    [in]    index            �������
	//�� �� ֵ��
	//     true �����궨�ɹ�
	//�޸���־��
	//*******************************************************
	bool onlineCalibration(uchar* image, double disTheshold, cv::Point2f gazePoint, int index);

	//*******************************************************
	//��    �ܣ� �����߱궨---Mapping3D��
	//��������� 
	//    [in]    image            ���������ͼ������
	//    [in]    disThreshold     ͫ��������ͼ���в��ľ���pixel
	//    [in]    gazePoint        ��Ļ�ϵ�ע�ӵ�piexel
	//    [in]    index            �������
	//�� �� ֵ��
	//     true �����궨�ɹ�
	//�޸���־��
	//*******************************************************
	bool onlineCalibration3D(uchar* image, double disTheshold, cv::Point3f gazePoint, int index);

	//*******************************************************
	//��    �ܣ� ��Mapping֮��һ���Ǹ���궨�������⡿
	//��������� 
	//    [in]    threshold            ƫ�����ֵ
	//�� �� ֵ��
	//     ��15 bi��ÿ�����ش��������16bit�����Ƿ�궨�ɹ� ,1 
	//�޸���־��
	//*******************************************************
	int GetMappingResult(double threshold);

	int GetMappingResult9(double threshold);

	// ��ΧscalarZ
	double GetMappingResult9_3D(double threshold);


	//*******************************************************
	//��    �ܣ� ����һ�����߱궨֮��ֻҪǿ�ƴ˺����Ϳ��Բ��궨�� -----ע�⣺�������Ҫ���߱궨���ڶ�ȡ����֮ǰ���ò�����
	//��������� 
	//    
	//�� �� ֵ��
	//     true �����궨�ɹ�
	//�޸���־��
	//*******************************************************
	bool onlineCalibrationIsOK();

	//*******************************************************
	//��    �ܣ� �������ӵ㡿
	//��������� 
	//    [out]    x         �ӵ�����Ļ��X������ꣻ
	//    [out]    y         �ӵ�����Ļ��Y������ꣻ
	//�� �� ֵ��
	//     int   �ӵ㣬��Ļ�ӵ�λ��
	//�޸���־��
	//*******************************************************
	int CalcGazePointPosition();

	//*******************************************************
	//��    �ܣ� �������ӵ�3D��
	//��������� 
	//    [out]    x         �ӵ�����Ļ��X������ꣻ
	//    [out]    y         �ӵ�����Ļ��Y������ꣻ
	//�� �� ֵ��
	//     int   �ӵ㣬��Ļ�ӵ�λ��
	//�޸���־��
	//*******************************************************
	int CalcGazePointPosition3D(int *gazePoint);
	//*******************************************************
	//��    �ܣ� �����ͫ�װ뾶��
	//��������� 

	//�� �� ֵ��
	//     double   ͫ�װ뾶
	//�޸���־��
	//*******************************************************

	int CalcGazePointPosition3D(Detector3DResult &result3D, cv::Mat& showImage_, cv::Mat& color_image_);

	double GetPupilRadius();


	//*******************************************************
	//��    �ܣ� �����ͫ�����Ŷȡ�
	//��������� 

	//�� �� ֵ��
	//     double   ͫ�����Ŷ�
	//�޸���־��
	//*******************************************************
	double GetPupilConfidence();

	//*******************************************************
	//��    �ܣ� ��գ�ۼ�⡿
	//��������� 
	//    
	//�� �� ֵ��
	//     0��   ����ά��ԭ״�����ۻ���ۣ�
	//     -1:   ���۵Ķ���
	//      1:   ���۵Ķ���
	//�޸���־��
	//*******************************************************
	int GetBlinkDectect();



private:
	//*******************************************************
	//��    �ܣ� �������ӵ㡿
	//��������� 
	//    [in]    pupilL         ��ͼ��ͫ�����ģ�
	//    [in]    pupilR         ��ͼ��ͫ�����ģ�
	//    [in]    irptsL         ����������ĵ���λ��
	//    [in]    irptsR         ����������ĵ���λ��
	//    [in]    model          0 ���߱궨ʱʹ�ã� 1 �궨֮��ʹ��
	//�� �� ֵ��
	//     int   �ӵ㣬��Ļ�ӵ�λ��
	//�޸���־��
	//*******************************************************
	bool SortLightPosition(cv::Point2f pupilL, cv::Point2f pupilR, std::vector<cv::Point2f> &irptsL, std::vector<cv::Point2f> &irptsR, int model);

public:
	std::string m_filename;
	cv::Mat m_R,m_T;                     // �������������λ�ù�ϵ�����Ϊ�ο�ϵ                    -Ok
	cv::Mat m_K1,m_K2;
	cv::Mat m_D1,m_D2;

	cv::Mat m_Rpd,m_Tpd;                 // ��Ļ-->���                                           -Ok

	cv::Mat m_plane;                     // ��Ļ��ƽ�淽��                                          -Ok
	double m_Plane_scale;                // ��Ļ�����ߴ�����صĹ�ϵ�� mm/pixel
	cv::Mat m_LightPosition;             // �����λ�ã��д�����ĸ������������                 -Ok
	cv::Mat m_Angle;                     // kappa��                                                 -pOk
	cv::Mat m_imageL,m_imageR;           // ���ȡ����ͼ��                                          -Ok
		
	bool m_GazeSame;                    // m_GazeSame   0������һ��ͼ����Ҫ���£�1�����ڶ���ͼ����Ҫ���£�
	bool m_isOnLineCalibration;         // ���߱궨���֮��˱�־λΪtrue�����ǿ��true������������߱궨��

	box2d m_pupil;                      // ͫ������
	std::vector<cv::Point2f> m_PupilPoision;         // �궨��16��ͫ�׵������
	std::vector<cv::Point2f> m_screenPoision;        // �궨��16���㣬ԭ������
	//cv::Mat m_mapping;
	float m_mapping[12];
	std::vector<pointf> m_calibratePupil;             // ����ƫ��
	Detector2D detect2d;


	double m_PupilRadius;
	double m_PupilConfidence;

	BlinkDetection m_BlinkDection;



	//  3D ʹ�õ���Ϣ
	singleeyefitter::EyeModelFitter mEyeModel;
	std::vector<singleeyefitter::Detector3DResult> m_3DPupilPoisionTemp;
	std::vector<cv::Point3f> m_3DScreenPosionTemp;
	

	std::vector<std::vector<singleeyefitter::Detector3DResult>> m_3DPupilPoisionALL;
	std::vector<std::vector<cv::Point3f>> m_3DScreenPosionALL;
	

	int maxSample;                                                                             // ÿ��궨��ɼ������ĸ���
	int maxCalibrationPoint;                                                                   // һ���ɼ�������궨�������

	cv::Mat m_eye0ToWorld;
	cv::Mat m_planeInCamera;


	int m_discardNum;                                                                           // ���ڱ궨����ɣ�

	                                                              
	
};



#endif